app/views/home/index.html.erb


            <% ruta = (albums_path if current_user.albums.count != 1) || current_user.albums.first %>
---
SELECT  `albums`.* FROM `albums` WHERE `albums`.`user_id` = '3' ORDER BY `albums`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `albums` WHERE `albums`.`user_id` = '3'