app/controllers/albums_controller.rb

  def show
    @album = Album.find(params[:id])
    @photos = @album.photos.paginate(page: params[:page], per_page: 3)
---
SELECT  `albums`.* FROM `albums` WHERE `albums`.`id` = 3 LIMIT 1
SELECT  `photos`.* FROM `photos` WHERE `photos`.`album_id` = '1' LIMIT 3 OFFSET 0
SELECT COUNT(*) FROM `photos` WHERE `photos`.`album_id` = '1'