app/controllers/photos_controller.rb

  def index
    @photos = Photo.all.paginate(page: params[:page], per_page: 4)
---
SELECT  `photos`.* FROM `photos` LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `photos`