app/controllers/photos_controller.rb

SELECT  `photos`.* FROM `photos` ORDER BY id DESC LIMIT 3 OFFSET 0
---
  def index
#    @photos = Photo.paginate(:page => params[:page], :per_page => 2)
    @photos = Photo.all.paginate(page: params[:page], per_page: 3)