app/views/layouts/application.html.erb

              <li class="nav-item">
                <% if current_user.albums.count != 1 %>
---
SELECT COUNT(*) FROM `albums` WHERE `albums`.`user_id` = '3'

                <% else %>
                  <% album = current_user.albums.first %>
---
SELECT  `albums`.* FROM `albums` WHERE `albums`.`user_id` = '3' ORDER BY `albums`.`id` ASC LIMIT 1